app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "github", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    # @friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "first_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "asdf@gmail.com"], ["updated_at", "2024-08-08 10:16:52.226464"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 15]]
---
  def destroy
    @friend.destroy!